# St7GetEntitySetName

Returns the name of the specified entity set.

long St7GetEntitySetName(long uID, long SetNum, char* SetName, long MaxStringLen)

Input Parameters

uID

Strand7 model file ID.

SetNum

The number of the entity set.

MaxStringLen

The maximum number of characters allocated for SetName.

Output Parameters

SetName

The name of the entity set.